# Useful Python Code

## File read/write operations

In [1]:
# Useful Python code from Josh
# Set working directory
import os
os.chdir("/home/michael.kahn/Documents/Aim4/Aim4_SQL_scripts")
os.getcwd()

'/home/michael.kahn/Documents/Aim4/Aim4_SQL_scripts'

In [2]:
# list files in working directory
os.listdir('.')

['Josh_VM2_iPPRL_sqlscripts.sql',
 'Subqueries',
 'iPPRL_Create_Aim4_schema.sql',
 'iPPRL_Aim4_Analytics.sql',
 'Aim4_Scripts.code-workspace',
 'iPPRL_Aim4_DifferentLVs_in NetworkID',
 '.ipynb_checkpoints',
 'Aim4_Notebook.ipynb',
 'Untitled.ipynb',
 '_Code_Snippets.ipynb']

In [3]:
# To read a file containing SQL code
query = open('filename.sql', 'r')
 
df = pd.read_sql_query(query.read(),engine)
query.close()

FileNotFoundError: [Errno 2] No such file or directory: 'filename.sql'

In [ ]:
# To write an SQL statement to a file
# Rather than copy pasting, I would use this command to save my query:
with open('query.sql', 'w') as file:
  file.write(query)
file.close()

## DBMS initialization

In [4]:
# Tutorial "PostgreSQL Integration with Jupyter Notebook" by Andrei Teleron (posted Nov 3, 2019)
# https://medium.com/analytics-vidhya/postgresql-integration-with-jupyter-notebook-deb97579a38d
%load_ext sql

In [5]:
import pandas as pd
from sqlalchemy import create_engine

In [6]:
# sign into localhost PG server as postgres user connected to honestbroker database
%sql postgresql://postgres:postgres@localhost/honestbroker

In [7]:
engine=create_engine('postgresql://postgres:postgres@localhost/honestbroker')

In [8]:
# Example single line query using %sql
%sql select * from aim4.network_id limit 2

 * postgresql://postgres:***@localhost/honestbroker
2 rows affected.

[(1, 1, 326225415, 326225415), (2, 1, 326224223, 326224223)]

In [9]:
# Example multi-line query using %%sql
query = """select
 *
from
 aim4.network_id
limit 2"""
%sql $query

 * postgresql://postgres:***@localhost/honestbroker
2 rows affected.

[(1, 1, 326225415, 326225415), (2, 1, 326224223, 326224223)]

In [10]:
# Write results into a dataframe.
# Note triple single quotes. Can be used for multi-line SQL. 
# Use triple double-quotes since SQL can have single quotes as part of the SQL statement.
df=pd.read_sql('''select * from aim4.network_id limit 2''',engine)

In [11]:
df

   uid  run_id  network_id  prior_network_id
0    1       1   326225415         326225415
1    2       1   326224223         326224223

In [12]:
# Test code for determining unlinked versus linked completeness

query = """
with cteDummy as (
    select
        1 as network_id, 100 as uid, 'a' as Lv1, null as Lv2, 'a' as Lv3
    union all
    select 1, 200, 'a', null, 'b'
    union all
    select 1, 300, 'a',null, 'c'
    union all
    select 1, 400, null,null,'d'
    union all
    select 2, 500, null,null,null
    union all
    select 2, 600, 'z',null, null
    union all
    select 3, 700, null, null, 'z'
    union all
    select 3, 800, null , 'b' , null
)
-- Unlinked counts
(select 'Unlinked', count(uid) as denom, count(lv1),count(lv2), count(lv3)
from cteDummy)
union all
(select 'By network_id', network_id, case when count(lv1)=0 then 0 else 1 end 
                  , case when count(lv2) = 0 then 0 else 1 end a
 				, case when count(lv3)=0 then 0 else 1 end 
from cteDummy 
group by network_id
order by network_id asc)
union all
-- Linked counts
(select 'Linked', count(network_id) as denom, sum(lv1_flag), sum(lv2_flag), sum(lv3_flag)
	from (select network_id, case when count(lv1)=0 then 0 else 1 end as lv1_flag
                  , case when count(lv2) = 0 then 0 else 1 end as lv2_flag
 				, case when count(lv3)=0 then 0 else 1 end as lv3_flag
		  from cteDummy
		  group by network_id) zzz
)
;"""
df = pd.read_sql(query,engine)
df

        ?column?  denom  count  count  count
0       Unlinked      8      4      1      5
1  By network_id      1      1      0      1
2  By network_id      2      1      0      0
3  By network_id      3      0      1      1
4         Linked      3      2      1      2